app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @user = User.all

INSERT INTO "users" ("name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", nil], ["password", "[FILTERED]"], ["created_at", "2023-11-10 20:57:36.337828"], ["updated_at", "2023-11-10 20:57:36.337828"]]
---
  def create
    user = User.new(name: params[:name], password: params[:password])
    user.save